using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Text.RegularExpressions;

namespace Tekidoni
{
	internal static class WeatherUtility
	{
		private static Dictionary<string, string> prefectures = new Dictionary<string, string>()
		{
			{"北海道", "札幌"},
			{"青森", "青森"},
			{"岩手", "盛岡"},
			{"宮城", "仙台"},
			{"秋田", "秋田"},
			{"山形", "山形"},
			{"福島", "福島"},
			{"茨城", "水戸"},
			{"栃木", "宇都"},
			{"群馬", "前橋"},
			{"埼玉", "さいたま"},
			{"千葉", "千葉"},
			{"東京", "東京"},
			{"神奈川", "横浜"},
			{"新潟", "新潟"},
			{"富山", "富山"},
			{"石川", "金沢"},
			{"福井", "福井"},
			{"山梨", "甲府"},
			{"長野", "長野"},
			{"岐阜", "岐阜"},
			{"静岡", "静岡"},
			{"愛知", "名古屋"},
			{"三重", "津"},
			{"滋賀", "大津"},
			{"京都", "京都"},
			{"大阪", "大阪"},
			{"兵庫", "神戸"},
			{"奈良", "奈良"},
			{"和歌山", "和歌山"},
			{"鳥取", "鳥取"},
			{"島根", "松江"},
			{"岡山", "岡山"},
			{"広島", "広島"},
			{"山口", "山口"},
			{"徳島", "徳島"},
			{"香川", "高松"},
			{"愛媛", "松山"},
			{"高知", "高知"},
			{"福岡", "福岡"},
			{"佐賀", "佐賀"},
			{"長崎", "長崎"},
			{"熊本", "熊本"},
			{"大分", "大分"},
			{"宮崎", "宮崎"},
			{"鹿児島", "鹿児島"},
			{"沖縄", "那覇"}
		};
		private static Dictionary<string, int> cities = new Dictionary<string, int>()
		{
			{"稚内", 011000},
			{"旭川", 012010},
			{"留萌", 012020},
			{"網走", 013010},
			{"北見", 013020},
			{"紋別", 013030},
			{"根室", 014010},
			{"釧路", 014020},
			{"帯広", 014030},
			{"室蘭", 015010},
			{"浦河", 015020},
			{"札幌", 016010},
			{"岩見沢", 016020},
			{"倶知安", 016030},
			{"函館", 017010},
			{"江差", 017020},
			{"青森", 020010},
			{"むつ", 020020},
			{"八戸", 020030},
			{"盛岡", 030010},
			{"宮古", 030020},
			{"大船渡", 030030},
			{"仙台", 040010},
			{"白石", 040020},
			{"秋田", 050010},
			{"横手", 050020},
			{"山形", 060010},
			{"米沢", 060020},
			{"酒田", 060030},
			{"新庄", 060040},
			{"福島", 070010},
			{"小名浜", 070020},
			{"若松", 070030},
			{"水戸", 080010},
			{"土浦", 080020},
			{"宇都宮", 090010},
			{"大田原", 090020},
			{"前橋", 100010},
			{"みなかみ", 100020},
			{"さいたま", 110010},
			{"熊谷", 110020},
			{"秩父", 110030},
			{"千葉", 120010},
			{"銚子", 120020},
			{"館山", 120030},
			{"東京", 130010},
			{"大島", 130020},
			{"八丈島", 130030},
			{"父島", 130040},
			{"横浜", 140010},
			{"小田原", 140020},
			{"新潟", 150010},
			{"長岡", 150020},
			{"高田", 150030},
			{"相川", 150040},
			{"富山", 160010},
			{"伏木", 160020},
			{"金沢", 170010},
			{"輪島", 170020},
			{"福井", 180010},
			{"敦賀", 180020},
			{"甲府", 190010},
			{"河口湖", 190020},
			{"長野", 200010},
			{"松本", 200020},
			{"飯田", 200030},
			{"岐阜", 210010},
			{"高山", 210020},
			{"静岡", 220010},
			{"網代", 220020},
			{"三島", 220030},
			{"浜松", 220040},
			{"名古屋", 230010},
			{"豊橋", 230020},
			{"津", 240010},
			{"尾鷲", 240020},
			{"大津", 250010},
			{"彦根", 250020},
			{"京都", 260010},
			{"舞鶴", 260020},
			{"大阪", 270000},
			{"神戸", 280010},
			{"豊岡", 280020},
			{"奈良", 290010},
			{"風屋", 290020},
			{"和歌山", 300010},
			{"潮岬", 300020},
			{"鳥取", 310010},
			{"米子", 310020},
			{"松江", 320010},
			{"浜田", 320020},
			{"西郷", 320030},
			{"岡山", 330010},
			{"津山", 330020},
			{"広島", 340010},
			{"庄原", 340020},
			{"下関", 350010},
			{"山口", 350020},
			{"柳井", 350030},
			{"萩", 350040},
			{"徳島", 360010},
			{"日和佐", 360020},
			{"高松", 370000},
			{"松山", 380010},
			{"新居浜", 380020},
			{"宇和島", 380030},
			{"高知", 390010},
			{"室戸岬", 390020},
			{"清水", 390030},
			{"福岡", 400010},
			{"八幡", 400020},
			{"飯塚", 400030},
			{"久留米", 400040},
			{"佐賀", 410010},
			{"伊万里", 410020},
			{"長崎", 420010},
			{"佐世保", 420020},
			{"厳原", 420030},
			{"福江", 420040},
			{"熊本", 430010},
			{"阿蘇乙姫", 430020},
			{"牛深", 430030},
			{"人吉", 430040},
			{"大分", 440010},
			{"中津", 440020},
			{"日田", 440030},
			{"佐伯", 440040},
			{"宮崎", 450010},
			{"延岡", 450020},
			{"都城", 450030},
			{"高千穂", 450040},
			{"鹿児島", 460010},
			{"鹿屋", 460020},
			{"種子島", 460030},
			{"名瀬", 460040},
			{"那覇", 471010},
			{"名護", 471020},
			{"久米島", 471030},
			{"南大東", 472000},
			{"宮古島", 473000},
			{"石垣島", 474010},
			{"与那国島", 474020}
		};
		private static Dictionary<string, int> days = new Dictionary<string, int>()
		{
			{"今日", 0},
			{"きょう", 0},
			{"明日", 1},
			{"あした", 1},
			{"明後日", 2},
			{"あさって", 2},
		};
		internal static int ConvertCityNameToCode(string cityName)
		{
			// 「～都府県」「～市」を削除
			cityName = Regex.Replace(cityName, "東京都", "東京");
			cityName = Regex.Replace(cityName, "府$", "");
			cityName = Regex.Replace(cityName, "県$", "");
			cityName = Regex.Replace(cityName, "市$", "");
			// 県名は県庁所在地に変換
			if(prefectures.ContainsKey(cityName))
			{
				cityName = prefectures[cityName];
			}
			if (!cities.ContainsKey(cityName))
			{
				throw new CityException();
			}
			return cities[cityName];
		}
		internal static int ConvertNihongoToDay(string japanese)
		{
			if (!days.ContainsKey(japanese))
			{
				throw new DayException();
			}
			return days[japanese];
		}
	}
}
