using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Text.RegularExpressions;

namespace Tekidoni
{
	internal static class WeatherUtility
	{
		private static Dictionary<string, string> prefectures = new Dictionary<string, string>()
		{
			{"北海道", "札幌"},
			{"青森", "青森"},
			{"岩手", "盛岡"},
			{"宮城", "仙台"},
			{"秋田", "秋田"},
			{"山形", "山形"},
			{"福島", "福島"},
			{"茨城", "水戸"},
			{"栃木", "宇都"},
			{"群馬", "前橋"},
			{"埼玉", "さいたま"},
			{"千葉", "千葉"},
			{"東京", "東京"},
			{"神奈川", "横浜"},
			{"新潟", "新潟"},
			{"富山", "富山"},
			{"石川", "金沢"},
			{"福井", "福井"},
			{"山梨", "甲府"},
			{"長野", "長野"},
			{"岐阜", "岐阜"},
			{"静岡", "静岡"},
			{"愛知", "名古屋"},
			{"三重", "津"},
			{"滋賀", "大津"},
			{"京都", "京都"},
			{"大阪", "大阪"},
			{"兵庫", "神戸"},
			{"奈良", "奈良"},
			{"和歌山", "和歌山"},
			{"鳥取", "鳥取"},
			{"島根", "松江"},
			{"岡山", "岡山"},
			{"広島", "広島"},
			{"山口", "山口"},
			{"徳島", "徳島"},
			{"香川", "高松"},
			{"愛媛", "松山"},
			{"高知", "高知"},
			{"福岡", "福岡"},
			{"佐賀", "佐賀"},
			{"長崎", "長崎"},
			{"熊本", "熊本"},
			{"大分", "大分"},
			{"宮崎", "宮崎"},
			{"鹿児島", "鹿児島"},
			{"沖縄", "那覇"}
		};
#if false
		private static Dictionary<string, int> cities = new Dictionary<string, int>()
		{
			{"稚内", 011000},
			{"旭川", 012010},
			{"留萌", 012020},
			{"網走", 013010},
			{"北見", 013020},
			{"紋別", 013030},
			{"根室", 014010},
			{"釧路", 014020},
			{"帯広", 014030},
			{"室蘭", 015010},
			{"浦河", 015020},
			{"札幌", 016010},
			{"岩見沢", 016020},
			{"倶知安", 016030},
			{"函館", 017010},
			{"江差", 017020},
			{"青森", 020010},
			{"むつ", 020020},
			{"八戸", 020030},
			{"盛岡", 030010},
			{"宮古", 030020},
			{"大船渡", 030030},
			{"仙台", 040010},
			{"白石", 040020},
			{"秋田", 050010},
			{"横手", 050020},
			{"山形", 060010},
			{"米沢", 060020},
			{"酒田", 060030},
			{"新庄", 060040},
			{"福島", 070010},
			{"小名浜", 070020},
			{"若松", 070030},
			{"水戸", 080010},
			{"土浦", 080020},
			{"宇都宮", 090010},
			{"大田原", 090020},
			{"前橋", 100010},
			{"みなかみ", 100020},
			{"さいたま", 110010},
			{"熊谷", 110020},
			{"秩父", 110030},
			{"千葉", 120010},
			{"銚子", 120020},
			{"館山", 120030},
			{"東京", 130010},
			{"大島", 130020},
			{"八丈島", 130030},
			{"父島", 130040},
			{"横浜", 140010},
			{"小田原", 140020},
			{"新潟", 150010},
			{"長岡", 150020},
			{"高田", 150030},
			{"相川", 150040},
			{"富山", 160010},
			{"伏木", 160020},
			{"金沢", 170010},
			{"輪島", 170020},
			{"福井", 180010},
			{"敦賀", 180020},
			{"甲府", 190010},
			{"河口湖", 190020},
			{"長野", 200010},
			{"松本", 200020},
			{"飯田", 200030},
			{"岐阜", 210010},
			{"高山", 210020},
			{"静岡", 220010},
			{"網代", 220020},
			{"三島", 220030},
			{"浜松", 220040},
			{"名古屋", 230010},
			{"豊橋", 230020},
			{"津", 240010},
			{"尾鷲", 240020},
			{"大津", 250010},
			{"彦根", 250020},
			{"京都", 260010},
			{"舞鶴", 260020},
			{"大阪", 270000},
			{"神戸", 280010},
			{"豊岡", 280020},
			{"奈良", 290010},
			{"風屋", 290020},
			{"和歌山", 300010},
			{"潮岬", 300020},
			{"鳥取", 310010},
			{"米子", 310020},
			{"松江", 320010},
			{"浜田", 320020},
			{"西郷", 320030},
			{"岡山", 330010},
			{"津山", 330020},
			{"広島", 340010},
			{"庄原", 340020},
			{"下関", 350010},
			{"山口", 350020},
			{"柳井", 350030},
			{"萩", 350040},
			{"徳島", 360010},
			{"日和佐", 360020},
			{"高松", 370000},
			{"松山", 380010},
			{"新居浜", 380020},
			{"宇和島", 380030},
			{"高知", 390010},
			{"室戸岬", 390020},
			{"清水", 390030},
			{"福岡", 400010},
			{"八幡", 400020},
			{"飯塚", 400030},
			{"久留米", 400040},
			{"佐賀", 410010},
			{"伊万里", 410020},
			{"長崎", 420010},
			{"佐世保", 420020},
			{"厳原", 420030},
			{"福江", 420040},
			{"熊本", 430010},
			{"阿蘇乙姫", 430020},
			{"牛深", 430030},
			{"人吉", 430040},
			{"大分", 440010},
			{"中津", 440020},
			{"日田", 440030},
			{"佐伯", 440040},
			{"宮崎", 450010},
			{"延岡", 450020},
			{"都城", 450030},
			{"高千穂", 450040},
			{"鹿児島", 460010},
			{"鹿屋", 460020},
			{"種子島", 460030},
			{"名瀬", 460040},
			{"那覇", 471010},
			{"名護", 471020},
			{"久米島", 471030},
			{"南大東", 472000},
			{"宮古島", 473000},
			{"石垣島", 474010},
			{"与那国島", 474020}
		};
#endif
		private static Dictionary<string, int> cities = new Dictionary<string, int>()
		{
			{"稚内", 2127515},
			{"旭川", 2130629},
			{"留萌", 2128382},
			{"網走", 2130741},
			{"北見", 2129537},
			{"紋別", 2129163},
			{"根室", 2128975},
			{"釧路", 2129376},
			{"帯広", 2128815},
			{"室蘭", 2129101},
			{"浦河", 2127586},
			{"札幌", 2128295},
			{"岩見沢", 2129870},
			{"倶知安", 2129365},
			{"函館", 2130188},
			//{"江差", 017020},
			{"青森", 2130658},
			{"むつ", 2127878},
			{"八戸", 2130203},
			{"盛岡", 2111834},
			{"宮古", 2111884},
			{"大船渡", 2111530},
			{"仙台", 2111149},
			{"白石", 2111016},
			{"秋田", 2113124},
			{"横手", 2110506},
			{"山形", 2110556},
			{"米沢", 2110498},
			{"酒田", 1853140},
			{"新庄", 2111065},
			{"福島", 2112923},
			//{"小名浜", 070020},
			{"いわき", 2112539},
			//{"若松", 070030},
			{"水戸", 2111901},
			{"土浦", 6822099},
			{"宇都宮", 1849053},
			{"大田原", 2111325},
			{"前橋", 1857843},
			//{"みなかみ", 100020},
			{"高崎", 1851002},
			{"さいたま", 6940394},
			{"熊谷", 1858428},
			{"秩父", 1864637},
			{"千葉", 2113015},
			//{"銚子", 120020},
			{"銚子", 2112802},	// 波崎
			{"波崎", 2112802},
			{"館山", 1850523},
			{"東京", 1850147},
			{"川崎", 1859647},
			{"八王子", 1863440},
			{"大島", 1854431},	// 岡田おかた
			{"八丈島", 1854372}, // 大賀郷
			//{"父島", 130040},	// 小笠原
			{"横浜", 2127436},
			{"横須賀", 1848313},
			{"三浦", 1907309},
			{"平塚", 1862462},
			{"小田原", 1854747},
			{"新潟", 1855431},
			{"長岡", 1856199},
			//{"高田", 150030},
			{"上越", 6825489},
			{"佐渡", 1853371}, // 両津市
			{"富山", 1849876},
			{"高岡", 1851032},
			{"金沢", 1860243},
			{"輪島", 1848976},
			{"福井", 1863985},
			{"小浜", 1854849},
			{"敦賀", 1849592},
			{"甲府", 1859100},
			{"河口湖", 7281819},
			{"長野", 1856215},
			{"松本", 1857519},
			{"飯田", 1861864},
			{"岐阜", 1863641},
			{"高山", 1850892},
			{"静岡", 1851715},
			//{"網代", 220020},
			{"伊東", 1861290},
			{"下田", 1852357},
			{"三島", 1856977},
			{"浜松", 1863289},
			{"名古屋", 1856057},
			{"豊橋", 1849846},
			{"西尾", 1855189},
			{"津", 1849796},
			{"尾鷲", 1853514},
			{"四日市", 1848373},
			{"伊勢", 1861450},
			{"鳥羽", 1850345},
			{"松阪", 1857496},
			{"大津", 1853574},
			{"彦根", 1862636},
			{"米原", 1857769},
			{"京都", 1857910},
			{"舞鶴", 1857766},
			{"大阪", 1853909},
			{"堺", 1853195},
			{"岸和田", 1859383},
			{"神戸", 1859171},
			{"豊岡", 1849831},
			{"明石", 1847966},
			{"西宮", 1855207},
			{"尼崎", 1865387},
			{"姫路", 1862627},
			{"あわじ", 1851426},
			{"淡路", 1851426},
			{"淡路島", 1851426},
			{"洲本", 1851426},
			{"奈良", 1855612},
			//{"風屋", 290020},
			{"和歌山", 1926004},
			{"潮岬", 1858033},	// 串本
			{"串本", 1858033},
			{"鳥取", 1849892},
			{"米子", 1858707},
			{"松江", 1857550},
			{"浜田", 1863310},
			//{"西郷", 320030},
			{"出雲", 1861084},
			{"岡山", 1854383},
			{"津山", 1849519},
			{"倉敷", 1858311},
			{"広島", 1862415},
			{"庄原", 1851713},
			{"福山", 1863917},
			{"下関", 1852225},
			{"山口", 1848689},
			{"柳井", 1848550},
			{"萩", 1863418},
			{"徳島", 1850158},
			//{"日和佐", 360020},
			{"牟岐浦", 1856488},
			{"高松", 1851100},
			{"松山", 1926099},
			{"新居浜", 1855425},
			{"宇和島", 1926020},
			{"高知", 1859143},
			{"室戸岬", 1856392},
			{"清水", 2128159},
			{"福岡", 1863967},
			//{"八幡", 400020},
			{"北九州", 1859307},
			{"飯塚", 1861835},
			{"久留米", 1858088},
			{"佐賀", 1853303},
			{"伊万里", 1861677},
			{"長崎", 1856177},
			{"佐世保", 1852899},
			//{"厳原", 420030},
			{"対馬", 1854712},
			{"福江", 1863997},
			{"熊本", 1858421},
			{"阿蘇", 1853150},
			{"牛深", 1849154},
			{"人吉", 1862352},
			{"大分", 1854487},
			{"中津", 1855757},
			{"日田", 1862373},
			{"佐伯", 1853237},
			{"宮崎", 1856710},
			{"延岡", 1855095},
			{"都城", 1856775},
			{"高千穂", 1862588},// 日之影
			{"日之影", 1862588},
			{"鹿児島", 7303136},
			{"鹿屋", 1860112},
			{"志布志", 1852588},
			{"種子島", 1855203},// 西之表
			{"西之表", 1855203},
			{"名瀬", 1855540},
			{"那覇", 1856035},
			{"名護", 1856068},
			//{"久米島", 471030},
			{"南大東", 1852038},
			{"南大東島", 1852038},
			{"宮古島", 1862505},
			{"石垣島", 1861416},
			{"与那国", 1848266},
			{"与那国島", 1848266}
		};
		private static Dictionary<string, int> days = new Dictionary<string, int>()
		{
			{"今日", 0},
			{"きょう", 0},
			{"明日", 1},
			{"あした", 1},
			{"明後日", 2},
			{"あさって", 2},
		};
		internal static int ConvertCityNameToCode(string cityName)
		{
			// 「～都府県」「～市」を削除
			cityName = Regex.Replace(cityName, "東京都", "東京");
			cityName = Regex.Replace(cityName, "府$", "");
			cityName = Regex.Replace(cityName, "県$", "");
			cityName = Regex.Replace(cityName, "市$", "");
			// 県名は県庁所在地に変換
			if(prefectures.ContainsKey(cityName))
			{
				cityName = prefectures[cityName];
			}
			if (!cities.ContainsKey(cityName))
			{
				throw new CityException();
			}
			return cities[cityName];
		}
		internal static int ConvertNihongoToDay(string japanese)
		{
			if (!days.ContainsKey(japanese))
			{
				throw new DayException();
			}
			return days[japanese];
		}

		/*
		01d	clear sky			快晴	 
		02d	few clouds			晴れ	few clouds
		03d	scattered clouds	くもり	scattered clouds
		04d	broken clouds		くもり	broken clouds
		09d	shower rain			小雨	 
		10d	rain				雨	 
		11d	thunderstorm		雷雨	 
		13d	snow				雪	 
		50d	mist				霧	 
		 */

		internal static string ConvertEngToJpn(string eng)
		{
			switch(eng)
            {
				case "clear sky":
					return "快晴";
				case "few clouds":
					return "晴れ";
				case "scattered clouds":
					return "くもり";
				case "broken clouds":
					return "くもり";
				case "overcast clouds":
					return "くもり";
				case "shower rain":
					return "小雨";
				case "rain":
					return "雨";
				case "thunderstorm":
					return "雷雨";
				case "snow":
					return "雪";
				case "mist":
					return "霧";
				case "light rain":
					return "小雨";
				default:
					return eng;
			}
		}
	}
}
